StefanKDS/STM32F7_BasicSystem/BasicSystem/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "fatfs.h"
#include "lwip.h"
#include "lwip/apps/httpd.h"
#include "usb_device.h"
#include "usb_host.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stm32746g_discovery_qspi.h>
#include <stm32746g_discovery_lcd.h>
#include <stm32746g_discovery_ts.h>
#include "string.h"
#include "../../Menu/Menu.h"
#include "../../Views/SDView.h"
#include <stdlib.h>
#define IMG_NO_DATA
#include "../../Images/Inc/icon_M.h"
#include <stdbool.h>
#include <ScreenManager.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define SDRAM_TIMEOUT                            ((uint32_t)0xFFFF)
#define SDRAM_MODEREG_BURST_LENGTH_1             ((uint16_t)0x0000)
#define SDRAM_MODEREG_BURST_LENGTH_2             ((uint16_t)0x0001)
#define SDRAM_MODEREG_BURST_LENGTH_4             ((uint16_t)0x0002)
#define SDRAM_MODEREG_BURST_LENGTH_8             ((uint16_t)0x0004)
#define SDRAM_MODEREG_BURST_TYPE_SEQUENTIAL      ((uint16_t)0x0000)
#define SDRAM_MODEREG_BURST_TYPE_INTERLEAVED     ((uint16_t)0x0008)
#define SDRAM_MODEREG_CAS_LATENCY_2              ((uint16_t)0x0020)
#define SDRAM_MODEREG_CAS_LATENCY_3              ((uint16_t)0x0030)
#define SDRAM_MODEREG_OPERATING_MODE_STANDARD    ((uint16_t)0x0000)
#define SDRAM_MODEREG_WRITEBURST_MODE_PROGRAMMED ((uint16_t)0x0000)
#define SDRAM_MODEREG_WRITEBURST_MODE_SINGLE     ((uint16_t)0x0200)



/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

CRC_HandleTypeDef hcrc;

extern struct netif gnetif;

DMA2D_HandleTypeDef hdma2d;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c3;

QSPI_HandleTypeDef hqspi;

SD_HandleTypeDef hsd1;
DMA_HandleTypeDef hdma_sdmmc1_rx;
DMA_HandleTypeDef hdma_sdmmc1_tx;

SDRAM_HandleTypeDef hsdram1;

osThreadId defaultTaskHandHandle;
/* USER CODE BEGIN PV */
QueueHandle_t tsQueue;


static FMC_SDRAM_CommandTypeDef Command;
static TS_StateTypeDef  TS_State;
bool HoldTouch;
bool MenuActive = true;
bool SDCardActive = false;
bool NetViewActive = false;

ScreenManager* screenManager;

uint8_t hr;
uint8_t mn;
uint8_t sc;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_CRC_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_DMA2D_Init(void);
static void MX_FMC_Init(void);
static void MX_I2C3_Init(void);
static void MX_I2C1_Init(void);
static void MX_SDMMC1_SD_Init(void);
void StartDefaultTask(void const * argument);

/* USER CODE BEGIN PFP */
static void BSP_Config(void);
static void TS_Init(void);
static void ReactOnTouch(void);
static void QSPI_Init(void);
void NetViewTouchDetected(uint16_t x, uint16_t y);
void ViewTouchDetected(uint16_t x, uint16_t y);
void ViewKeyInput(uint8_t key);
void ShowNetView(uint8_t* headerString);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void TS_Init(void)
{
	uint8_t  status = 0;
	status = BSP_TS_Init(BSP_LCD_GetXSize(), BSP_LCD_GetYSize());
	HoldTouch = false;

	if (status != TS_OK)
	{
		BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
		BSP_LCD_SetTextColor(LCD_COLOR_RED);
		BSP_LCD_DisplayStringAtLine(5, (uint8_t *)"ERROR");
		BSP_LCD_DisplayStringAtLine(6, (uint8_t *)"Touchscreen cannot be initialized");
	}
}

void ReactOnTouch(void)
{
	TSDataStruct data;

	data.x = TS_State.touchX[0];
	data.y = TS_State.touchY[0];

	xQueueSend(tsQueue, &data, portMAX_DELAY); // Sende die Daten in die Queue
}

void ReactOnClick(uint16_t x ,uint16_t y)
{
	TSDataStruct data;
	data.x = x;
	data.y = y;

	xQueueSend(tsQueue, &data, portMAX_DELAY); // Sende die Daten in die Queue
}

void ReactOnKey(uint8_t key)
{
	//if(NetViewActive)
		//ViewKeyInput(key);
}

void SDCardView()
{
	MenuActive = false;
	NetViewActive = false;
	SDCardActive = true;
	ShowSDDirectories((uint8_t *)"SD Karte");
}

void NetView_View()
{
	MenuActive = false;
	SDCardActive = false;
	NetViewActive = true;
	ShowNetView((uint8_t *)"Network");
}

void OldMainMenu()
{
	MenuActive = true;
	SDCardActive = false;
	NetViewActive = false;
	RemoveAllMenuPoints();
	void (*networkview_ptr)() = &NetView_View;

	InitMenuPoints(3);
	AddMenuPoint(60, 150, 110, 40, LCD_COLOR_ST_MAGENTA2,networkview_ptr, (uint8_t *)"Netzwerk");
}

void BSP_Config(void)
{
	BSP_LCD_Init();
	BSP_LCD_LayerDefaultInit(0, LCD_FB_START_ADDRESS);
	BSP_LCD_LayerDefaultInit(1, LCD_FB_START_ADDRESS+(4*(BSP_LCD_GetXSize()*BSP_LCD_GetYSize())));
	BSP_LCD_SelectLayer(0);
	BSP_LCD_Clear(LCD_COLOR_TRANSPARENT);
	BSP_LCD_SetBackColor(LCD_COLOR_TRANSPARENT);
	BSP_LCD_SelectLayer(1);

